КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСпособПодтвержденияПолномочий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>ИсключениеДляОтдельныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНастройки</name>
    <comment>Для метрик</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/CommonForms/КонтурЛогистика_ПроверкаСертификатов/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекПользовательЯвляетсяАдминистратором = КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор();
	
	Отказ = ВыполнитьПроверку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ТекПользовательЯвляетсяАдминистратором Тогда		
		Элементы.СертификатыПользователь.Видимость = Ложь;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы Тогда
		Оповестить("ВыполнитьПроверкуСертификатов");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьФормуПроверкиСертификатов" Тогда
		
		Если ВыполнитьПроверку() Тогда
			Закрыть();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаСертификатов

&НаСервере
Функция ВыполнитьПроверку()
	
	ОчиститьТаблицуСертификатов();
	
	Результат = КонтурЛогистика_ОбщегоНазначенияСервер.СертификатыДляПроверки(ТекПользователь, ТекПользовательЯвляетсяАдминистратором);
	
	ЭтаФорма.Заголовок = "";
	Если Результат.КолвоПроблемныхСертификатов > 0 И Результат.КолвоПроблемныхМЧД > 0 Тогда		
		ЭтаФорма.Заголовок = "Истекает срок действия сертификатов и МЧД";		
	ИначеЕсли Результат.КолвоПроблемныхСертификатов > 0 И Результат.КолвоПроблемныхМЧД = 0 Тогда
		ЭтаФорма.Заголовок = "Истекает срок действия сертификатов";
	ИначеЕсли Результат.КолвоПроблемныхСертификатов = 0 И Результат.КолвоПроблемныхМЧД > 0 Тогда
		ЭтаФорма.Заголовок = "Истекает срок действия МЧД";
	КонецЕсли;
	
	Если Результат.КолвоНеПрошедшихПроверкуМЧД > 0 Тогда		
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + ?(ЗначениеЗаполнено(ЭтаФорма.Заголовок) , " и есть ошибки в МЧД", "Есть ошибки в МЧД");;
	КонецЕсли;
	
	Если Результат.СертификатыДЗ.Строки.Количество() > 0 Тогда
		
		Элементы.СертификатыДопПараметр.Видимость = Результат.ЗаполненДопПараметр;
		
		ЗаполнитьТаблицуСертификатов(Результат.СертификатыДЗ);
		
	Иначе		
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОчиститьТаблицуСертификатов()
	
	СертификатыДЗ = РеквизитФормыВЗначение("Сертификаты"); 
    СертификатыДЗ.Строки.Очистить(); 
    ЗначениеВРеквизитФормы(СертификатыДЗ, "Сертификаты");
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьТаблицуСертификатов()
	
	Строки = Сертификаты.ПолучитьЭлементы();
	
	Для Каждого Строка Из Строки Цикл
		
	    ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
	    Элементы.Сертификаты.Развернуть(ИдентификаторСтроки);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСертификатов(СертификатыДЗ)
	
	ЗначениеВДанныеФормы(СертификатыДЗ, Сертификаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыИОтветыНажатие(Элемент)
	
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПерейтиПоСсылке("https://support.kontur.ru/ca/ustanovka-i-kopirovaniye");
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекКолонка = Поле;
		ИмяКолонки = ТекКолонка.Имя;
					
		Если ИмяКолонки = "СертификатыОрганизация" Тогда
			
			ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
			
			Если Элементы.Сертификаты.Развернут(ИдентификаторСтроки) Тогда				
				Элементы.Сертификаты.Свернуть(ИдентификаторСтроки);				
			Иначе				
				Элементы.Сертификаты.Развернуть(ИдентификаторСтроки);				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИмяКолонки = "СертификатыДействия" И ТекущиеДанные.Действия = "Проверить" Тогда
			
			ТекущаяНастройкаСертификата = Сертификаты.НайтиПоИдентификатору(Элементы.Сертификаты.ТекущаяСтрока);
			
			СтруктураЗаписи = Новый Структура("ОрганизацияДиадок, Пользователь1С, СертификатНаСервере, ДопПараметр, Период",
				ТекущаяНастройкаСертификата.ОрганизацияДиадок, ТекущаяНастройкаСертификата.Пользователь, ТекущаяНастройкаСертификата.СертификатНаСервере,
				ТекущаяНастройкаСертификата.ДопПараметр, ТекущаяНастройкаСертификата.Период);
			
			МассивКонструктораКлюча = Новый Массив;
			МассивКонструктораКлюча.Добавить(СтруктураЗаписи);
			
			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.КонтурЛогистика_НастройкиПодписания", МассивКонструктораКлюча);
			ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи", ПараметрыФормы, 
				,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
						
		ИначеЕсли ИмяКолонки = "СертификатыДействия" И ТекущиеДанные.Действия = "Заменить" Тогда
						
			ТекущаяНастройкаСертификата = Сертификаты.НайтиПоИдентификатору(Элементы.Сертификаты.ТекущаяСтрока);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Сертификат", ТекущаяНастройкаСертификата.Сертификат);
			ПараметрыФормы.Вставить("МЧД", ТекущаяНастройкаСертификата.МЧД);
			Если ЗначениеЗаполнено(ТекущаяНастройкаСертификата.ДопПараметр) Тогда
				ПараметрыФормы.Вставить("ДопПараметр", ТекущаяНастройкаСертификата.ДопПараметр);
			КонецЕсли;
			ПараметрыФормы.Вставить("СостояниеСертификата", ТекущаяНастройкаСертификата.СостояниеСертификата);
			ПараметрыФормы.Вставить("СостояниеМЧД", ТекущаяНастройкаСертификата.СостояниеМЧД);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ДействияПроверкиСертификатМЧД", ПараметрыФормы, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозжеНажатие(Элемент)
	
	Оповестить("ВыполнитьПроверкуСертификатов");
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
